#+TITLE:Org Cheatsheat
# The next lines says that I can make 10 levels of headlines, and org will treat those headlines as how to structure the book into

# chapters, then sections, then subsections, then sub-sub-sections, etc.
#+OPTIONS: H:10 toc: nil

** An sql example
    :PROPERTIES:
    :engine: mysql
    :dbhost: localhost
    :dbuser: root
    :dbpassword: <your password here>
    :database: usbc
    :END:

    #+name: my_query
    #+BEGIN_SRC sql
      SELECT first, last FROM users WHERE last = 'Branson' limit 5
    #+END_SRC

    #+RESULTS: my_query
    | first  | last    |
    |--------+---------|
    | Joshua | Branson |
    | Joshua | Branson |
    | Joshua | Branson |
    | Joshua | Branson |

    That "my_query" block can be passed as input to the following code block
    #+BEGIN_SRC emacs-lisp :var x=my_query
      (print x)

    #+END_SRC

    #+RESULTS:
    | Joshua | Branson |
    | Joshua | Branson |
    | Joshua | Branson |
    | Joshua | Branson |

    One can also tell emacs NOT to export the results of a code execution via
    #+BEGIN_SRC emacs-lisp :exports none
      (print "hello")
    #+END_SRC

    #+RESULTS:
    : hello



